kufirre/sensecap-smartbin/sdkconfig.defaults
# SenseCap SmartBin v2.0 Configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Additional SPIRAM settings for better WebRTC performance (from working example)
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# Disable external stack memory to fix SSCMA client RX buffer issues  
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=n
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=10000
# Reduce main task stack size to match working example
CONFIG_ESP_MAIN_TASK_STACK_SIZE=3584
# Disable watchdogs to avoid conflicts during WebRTC operation (from working example)
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_TASK_WDT_EN=n
# Disable ESP event posting from ISR to avoid interrupt conflicts (from working example)
CONFIG_ESP_EVENT_POST_FROM_ISR=n

# WiFi Configuration - Match working example RX buffer and BA window settings
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_RX_BA_WIN=6

# UART Configuration for SSCMA client communication
CONFIG_UART_ISR_IN_IRAM=y

# File system and network configuration for SSCMA client
CONFIG_FATFS_LFN_STACK=y
CONFIG_FREERTOS_HZ=1000
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
CONFIG_LWIP_TCP_WND_DEFAULT=5744

# Application Configuration
CONFIG_WIFI_SSID="myssid"
CONFIG_WIFI_PASSWORD="mypassword"
CONFIG_POSTCODE="SW1A 1AA"

# HTTP Client Configuration
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# I2C Driver Configuration - Match working example (use new driver without IRAM conflicts)
# CONFIG_I2C_ISR_IRAM_SAFE is not set
CONFIG_I2C_ENABLE_SLAVE_DRIVER_VERSION_2=y
# MbedTLS Configuration - Enable DTLS for peer connections
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_HARDWARE_RSA=n
CONFIG_MBEDTLS_ACCELERATOR_ECDSA=y
CONFIG_MBEDTLS_ECP_DP_SECP256R1_ENABLED=y

# LCD and LVGL performance/stability tuning
# Reduce SPI DMA transfer size and LVGL flush chunk size to avoid SPI queue failures

# LVGL Color Quality - Fix washed out colors
CONFIG_LV_COLOR_MIX_ROUND_OFS=0
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_BSP_LCD_SPI_DMA_SIZE_DIV=16
CONFIG_BSP_LCD_PANEL_SPI_TRANS_Q_DEPTH=1
CONFIG_LVGL_DRAW_BUFF_HEIGHT=120

# LVGL Camera Requirements (from sscma_client_monitor)
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEM_BUF_MAX_NUM=32
CONFIG_LV_USE_LOG=y
CONFIG_LV_USE_SJPG=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_LV_DEMO_WIDGETS_SLIDESHOW=y